Application/advanceyii/backend/controllers/RoomsegmentationController.php

SELECT * FROM `monthyear`
---
	public function actionImport(){
		$model = new UploadForm();
		$monthyears = Monthyear::find()->all();