Application/advanceyii/backend/controllers/RoomflashController.php

	public function actionImport(){
		$model = new UploadForm();
		$monthyears = Monthyear::find()->all();
---
SELECT * FROM `monthyear`