Application/advanceyii/backend/controllers/SiteController.php

    public function actionIndex()
    {
		$results =(new \yii\db\Query())
		->select('my.month, rf.OccupancyActual, rf.OccupancyLY, rf.roomRevParActual, rf.roomRevParLY, rf.roomRevenueActual, rf.roomRevenueLY,rf.adrActual, rf.adrLY')
		->from('roomflash rf')
		->join('LEFT JOIN', 'monthyear my', 'my.id = rf.monthYear_id')
		->all();
		$months = array();
		$Occupancy = array();
		$OccupancyLY = array();
		$roomRevPar = array();
		$roomRevParLY = array();
		$roomRevenue = array();
		$roomRevenueLY = array();
		$adr = array();
		$adrLY = array();
		foreach($results as $result){
			array_push($months, $result['month']);
			array_push($Occupancy, (int)$result['OccupancyActual']);
			array_push($roomRevPar, (int)$result['roomRevParActual']);
			array_push($roomRevenue, (int)$result['roomRevenueActual']);
			array_push($OccupancyLY, (int)$result['OccupancyLY']);
			array_push($roomRevParLY, (int)$result['roomRevParLY']);
			array_push($roomRevenueLY, (int)$result['roomRevenueLY']);
			array_push($adr, (int)$result['adrActual']);
			array_push($adrLY, (int)$result['adrLY']);
		}

		$individual =(new \yii\db\Query())
		->select('sum(rs.actualRNS) as total')
		->from('roomsegmentation rs')
		->where("rs.roomType in ('Rack','Corporate','Corporate Others','Packages/Promo','Wholesale Online','Wholesale Offline','Individual Others','Industry Rate')")
		->all();

		$group =(new \yii\db\Query())
		->select('sum(rs.actualRNS) as total')
		->from('roomsegmentation rs')
		->where("rs.roomType in ('Corporate Meetings','Convention/Association','Govt/NGOs','Group Tours','Group Others')")
		->all();

		$roomsoldls =(new \yii\db\Query())
		->select('sum(rf.roomSoldLY) as total')
		->from('roomflash rf')
		->all();

		$roomavailable =(new \yii\db\Query())
		->select('sum(rf.roomAvailableActual) as total')
		->from('roomflash rf')
		->all();
---
SELECT `my`.`month`, `rf`.`OccupancyActual`, `rf`.`OccupancyLY`, `rf`.`roomRevParActual`, `rf`.`roomRevParLY`, `rf`.`roomRevenueActual`, `rf`.`roomRevenueLY`, `rf`.`adrActual`, `rf`.`adrLY` FROM `roomflash` `rf` LEFT JOIN `monthyear` `my` ON my.id = rf.monthYear_id
SELECT sum(rs.actualRNS) as total FROM `roomsegmentation` `rs` WHERE rs.roomType in ('Rack','Corporate','Corporate Others','Packages/Promo','Wholesale Online','Wholesale Offline','Individual Others','Industry Rate')
SELECT sum(rs.actualRNS) as total FROM `roomsegmentation` `rs` WHERE rs.roomType in ('Corporate Meetings','Convention/Association','Govt/NGOs','Group Tours','Group Others')
SELECT sum(rf.roomSoldLY) as total FROM `roomflash` `rf`
SELECT sum(rf.roomAvailableActual) as total FROM `roomflash` `rf`

    public function actionCharts()
    {
		$results =(new \yii\db\Query())
		->select('my.month, rf.OccupancyActual, rf.OccupancyLY, rf.roomRevParActual, rf.roomRevParLY, rf.roomRevenueActual, rf.roomRevenueLY,rf.adrActual, rf.adrLY')
		->from('roomflash rf')
		->join('LEFT JOIN', 'monthyear my', 'my.id = rf.monthYear_id')
		->all();
		$months = array();
		$Occupancy = array();
		$OccupancyLY = array();
		$roomRevPar = array();
		$roomRevParLY = array();
		$roomRevenue = array();
		$roomRevenueLY = array();
		$adr = array();
		$adrLY = array();
		foreach($results as $result){
			array_push($months, $result['month']);
			array_push($Occupancy, (int)$result['OccupancyActual']);
			array_push($roomRevPar, (int)$result['roomRevParActual']);
			array_push($roomRevenue, (int)$result['roomRevenueActual']);
			array_push($OccupancyLY, (int)$result['OccupancyLY']);
			array_push($roomRevParLY, (int)$result['roomRevParLY']);
			array_push($roomRevenueLY, (int)$result['roomRevenueLY']);
			array_push($adr, (int)$result['adrActual']);
			array_push($adrLY, (int)$result['adrLY']);
		}

		$results2 =(new \yii\db\Query())
		->select('my.month, rs.actualRNS, rs.lastYearRNS, rs.actualARR, rs.lastYearARR')
		->from('roomsegmentation rs')
		->join('LEFT JOIN', 'monthyear my', 'my.id = rs.monthYear_id')
		->all();
---
SELECT `my`.`month`, `rf`.`OccupancyActual`, `rf`.`OccupancyLY`, `rf`.`roomRevParActual`, `rf`.`roomRevParLY`, `rf`.`roomRevenueActual`, `rf`.`roomRevenueLY`, `rf`.`adrActual`, `rf`.`adrLY` FROM `roomflash` `rf` LEFT JOIN `monthyear` `my` ON my.id = rf.monthYear_id
SELECT `my`.`month`, `rs`.`actualRNS`, `rs`.`lastYearRNS`, `rs`.`actualARR`, `rs`.`lastYearARR` FROM `roomsegmentation` `rs` LEFT JOIN `monthyear` `my` ON my.id = rs.monthYear_id

    public function actionForecast()
    {
    	$results =(new \yii\db\Query())
		->select('my.month, rf.OccupancyActual, rf.OccupancyLY, rf.roomRevParActual, rf.roomRevParLY, rf.roomRevenueActual, rf.roomRevenueLY,rf.adrActual, rf.adrLY')
		->from('roomflash rf')
		->join('LEFT JOIN', 'monthyear my', 'my.id = rf.monthYear_id')
		->all();

		$months = array();
		$Occupancy = array();
		$OccupancyLY = array();
		$roomRevPar = array();
		$roomRevParLY = array();
		$roomRevenue = array();
		$roomRevenueLY = array();
		$adr = array();
		$adrLY = array();
		foreach($results as $result){
			array_push($months, $result['month']);
			array_push($Occupancy, (int)$result['OccupancyActual']);
			array_push($roomRevPar, (int)$result['roomRevParActual']);
			array_push($roomRevenue, (int)$result['roomRevenueActual']);
			array_push($OccupancyLY, (int)$result['OccupancyLY']);
			array_push($roomRevParLY, (int)$result['roomRevParLY']);
			array_push($roomRevenueLY, (int)$result['roomRevenueLY']);
			array_push($adr, (int)$result['adrActual']);
			array_push($adrLY, (int)$result['adrLY']);
		}

		$individual =(new \yii\db\Query())
		->select('sum(rs.actualRNS) as total')
		->from('roomsegmentation rs')
		->where("rs.roomType in ('Rack','Corporate','Corporate Others','Packages/Promo','Wholesale Online','Wholesale Offline','Individual Others','Industry Rate')")
		->all();

		$group =(new \yii\db\Query())
		->select('sum(rs.actualRNS) as total')
		->from('roomsegmentation rs')
		->where("rs.roomType in ('Corporate Meetings','Convention/Association','Govt/NGOs','Group Tours','Group Others')")
		->all();

		$roomsoldls =(new \yii\db\Query())
		->select('sum(rf.roomSoldLY) as total')
		->from('roomflash rf')
		->all();

		$roomavailable =(new \yii\db\Query())
		->select('sum(rf.roomAvailableActual) as total')
		->from('roomflash rf')
		->all();

		$results2 =(new \yii\db\Query())
		->select('my.month, rs.actualRNS, rs.lastYearRNS, rs.actualARR, rs.lastYearARR')
		->from('roomsegmentation rs')
		->join('LEFT JOIN', 'monthyear my', 'my.id = rs.monthYear_id')
		->all();
---
SELECT `my`.`month`, `rf`.`OccupancyActual`, `rf`.`OccupancyLY`, `rf`.`roomRevParActual`, `rf`.`roomRevParLY`, `rf`.`roomRevenueActual`, `rf`.`roomRevenueLY`, `rf`.`adrActual`, `rf`.`adrLY` FROM `roomflash` `rf` LEFT JOIN `monthyear` `my` ON my.id = rf.monthYear_id
SELECT sum(rs.actualRNS) as total FROM `roomsegmentation` `rs` WHERE rs.roomType in ('Rack','Corporate','Corporate Others','Packages/Promo','Wholesale Online','Wholesale Offline','Individual Others','Industry Rate')
SELECT sum(rs.actualRNS) as total FROM `roomsegmentation` `rs` WHERE rs.roomType in ('Corporate Meetings','Convention/Association','Govt/NGOs','Group Tours','Group Others')
SELECT sum(rf.roomSoldLY) as total FROM `roomflash` `rf`
SELECT sum(rf.roomAvailableActual) as total FROM `roomflash` `rf`
SELECT `my`.`month`, `rs`.`actualRNS`, `rs`.`lastYearRNS`, `rs`.`actualARR`, `rs`.`lastYearARR` FROM `roomsegmentation` `rs` LEFT JOIN `monthyear` `my` ON my.id = rs.monthYear_id